app/Models/TransaksiModel.php

SELECT `layanan`.`nama_layanan`, `ruangan`.`nomor_ruangan`, `transaksi`.`tanggal_booking`, `transaksi`.`tanggal_checkout`, `transaksi`.`total`
FROM `transaksi`
JOIN `paket` ON `transaksi`.`id_paket` = `paket`.`id_paket`
JOIN `layanan` ON `paket`.`id_layanan` = `layanan`.`id_layanan`
JOIN `ruangan` ON `paket`.`id_ruangan` = `ruangan`.`id_ruangan`
WHERE `transaksi`.`id_user` = '4'
---
    public function getTransaksiByUserId($userId)
    {
        return $this->select('transaksi.id_transaksi, layanan.nama_layanan, ruangan.nomor_ruangan, transaksi.tanggal_booking, transaksi.tanggal_checkout, transaksi.total, transaksi.status')
            ->join('paket', 'transaksi.id_paket = paket.id_paket')
            ->join('layanan', 'paket.id_layanan = layanan.id_layanan')
            ->join('ruangan', 'paket.id_ruangan = ruangan.id_ruangan')
            ->where('transaksi.id_user', $userId)
            ->findAll();